test_texts = [
    # Веб-разработка — 0
    "Разработать корпоративный сайт компании с главной страницей, разделом услуг и формой обратной связи.",
    "Создать интернет-магазин с каталогом товаров, корзиной и возможностью оформления заказа.",

    # Мобильное приложение — 1
    "Разработать мобильное приложение для заказа еды с каталогом ресторанов и отслеживанием доставки.",
    "Создать приложение для iOS и Android, в котором пользователи смогут вести список своих задач.",

    # Дизайн — 2
    "Разработать современный дизайн главной страницы сайта IT-компании.",
    "Создать UI/UX дизайн интернет-магазина с каталогом, карточками товаров и корзиной.",

    # Аналитика — 3
    "Проанализировать продажи за последний год и определить наиболее прибыльные категории товаров.",
    "Нужно построить отчет по активности пользователей на сайте и определить основные точки оттока.",

    # Маркетинг — 4
    "Разработать маркетинговую стратегию для запуска нового онлайн-сервиса.",
    "Нужно подготовить контент-план для продвижения бренда в социальных сетях.",
]

test_correct_categories_ids = [
    # Веб-разработка — 0
    0, 0,

    # Мобильное приложение — 1
    1, 1,

    # Дизайн — 2
    2, 2,

    # Аналитика — 3
    3, 3,

    # Маркетинг — 4
    4, 4
]